In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data/flickr_data2.csv")
df.head()

/var/folders/1k/m4xg7w3579vbn16vxrz252m80000gn/T/ipykernel_19905/3488980070.py:1: DtypeWarning: Columns (11,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("data/flickr_data2.csv")

,id,user,lat,long,tags,title,date_taken_minute,date_taken_hour,date_taken_day,date_taken_month,date_taken_year,date_upload_minute,date_upload_hour,date_upload_day,date_upload_month,date_upload_year,Unnamed: 16,Unnamed: 17,Unnamed: 18
0,4395181099,30624617@N03,45.754858,4.821710,"chair,lyon,rh么ne,chaise,rh么nealpes",Chaises avec vue,11.0,15,28,2,2010,23,20,28.0,2,2010.0,NaN,NaN,NaN
1,4394748717,35853470@N00,45.753270,4.862953,NaN,NaN,51.0,17,28,2,2010,52,17,28.0,2,2010.0,NaN,NaN,NaN
2,4394694699,11817998@N05,45.760655,4.846564,"365,iphone",59/365 - R46 V103 B163,29.0,17,28,2,2010,33,17,28.0,2,2010.0,NaN,NaN,NaN
3,4394803790,11545749@N06,45.784000,4.874072,"nin,nineinchnails,gift,screening,toiou,avott",2010-01-29 Toiou Avott Lyon,15.0,20,28,1,2010,38,12,28.0,2,2010.0,NaN,NaN,NaN
4,4394803554,11545749@N06,45.784000,4.874072,"lyon,nin,nineinchnails,gift,screening,toiou,avott",2010-01-28 Toiou Avott Lyon,10.0,20,28,1,2010,38,12,28.0,2,2010.0,NaN,NaN,NaN

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 420240 entries, 0 to 420239
Data columns (total 19 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   id                   420240 non-null  int64
 1    user                420240 non-null  object
 2    lat                 420240 non-null  float64
 3    long                420240 non-null  float64
 4    tags                316730 non-null  object
 5    title               381911 non-null  object
 6    date_taken_minute   420239 non-null  float64
 7    date_taken_hour     420240 non-null  int64
 8    date_taken_day      420240 non-null  int64
 9    date_taken_month    420240 non-null  int64
 10   date_taken_year     420240 non-null  int64
 11   date_upload_minute  420228 non-null  object
 12   date_upload_hour    420238 non-null  object
 13   date_upload_day     420238 non-null  float64
 14   date_upload_month   420240 non-null  int64
 15   date_upload_year    420239 non-null  float64
 16  Unnamed: 16          142 non-null     float64
 17  Unnamed: 17          0 non-null       float64
 18  Unnamed: 18          2 non-null       float64
dtypes: float64(8), int64(6), object(5)
memory usage: 60.9+ MB

In [4]:
# remove the unnecessary space from column names
df.columns = df.columns.str.strip()  # VERY IMPORTANT

# Drop unnamed columns (they contain mostly NaN values)
df.drop(columns=["Unnamed: 16", "Unnamed: 17", "Unnamed: 18"], inplace=True)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 420240 entries, 0 to 420239
Data columns (total 16 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   id                  420240 non-null  int64
 1   user                420240 non-null  object
 2   lat                 420240 non-null  float64
 3   long                420240 non-null  float64
 4   tags                316730 non-null  object
 5   title               381911 non-null  object
 6   date_taken_minute   420239 non-null  float64
 7   date_taken_hour     420240 non-null  int64
 8   date_taken_day      420240 non-null  int64
 9   date_taken_month    420240 non-null  int64
 10  date_taken_year     420240 non-null  int64
 11  date_upload_minute  420228 non-null  object
 12  date_upload_hour    420238 non-null  object
 13  date_upload_day     420238 non-null  float64
 14  date_upload_month   420240 non-null  int64
 15  date_upload_year    420239 non-null  float64
dtypes: float64(5), int64(6), object(5)
memory usage: 51.3+ MB

In [5]:
print(f"Rows removed: {df.duplicated().sum()}")
df = df.drop_duplicates()
print(f"New dataframe length: {len(df)}\n")
df.info()

Rows removed: 232642
New dataframe length: 187598

<class 'pandas.core.frame.DataFrame'>
Index: 187598 entries, 0 to 420239
Data columns (total 16 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   id                  187598 non-null  int64
 1   user                187598 non-null  object
 2   lat                 187598 non-null  float64
 3   long                187598 non-null  float64
 4   tags                140629 non-null  object
 5   title               170633 non-null  object
 6   date_taken_minute   187597 non-null  float64
 7   date_taken_hour     187598 non-null  int64
 8   date_taken_day      187598 non-null  int64
 9   date_taken_month    187598 non-null  int64
 10  date_taken_year     187598 non-null  int64
 11  date_upload_minute  187594 non-null  object
 12  date_upload_hour    187597 non-null  object
 13  date_upload_day     187597 non-null  float64
 14  date_upload_month   187598 non-null  int64
 15  date_upload_year    187597 non-null  float64
dtypes: float64(5), int64(6), object(5)
memory usage: 24.3+ MB

In [6]:
# choose only rows with non-NaN date components
# (the following conversion to datetime will fail otherwise)
mask = (
    df["date_upload_minute"].isna()
    | df["date_upload_hour"].isna()
    | df["date_upload_day"].isna()
    | df["date_upload_month"].isna()
    | df["date_upload_year"].isna()
    | df["date_taken_minute"].isna()
    | df["date_taken_hour"].isna()
    | df["date_taken_day"].isna()
    | df["date_taken_month"].isna()
    | df["date_taken_year"].isna()
)
df = df[~mask]
print(f"Rows removed: {mask.sum()}")
print(f"New dataframe length: {len(df)}\n")
df.isna().sum()

Rows removed: 6
New dataframe length: 187592

id                        0
user                      0
lat                       0
long                      0
tags                  46968
title                 16963
date_taken_minute         0
date_taken_hour           0
date_taken_day            0
date_taken_month          0
date_taken_year           0
date_upload_minute        0
date_upload_hour          0
date_upload_day           0
date_upload_month         0
date_upload_year          0
dtype: int64

In [7]:
# change to datetime dtype
# consult this https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html
# the dates that are invalid will be converted to NaT
df["date_upload"] = pd.to_datetime(
    df[["date_upload_year", "date_upload_month", "date_upload_day", "date_upload_hour", "date_upload_minute"]].rename(
        columns={
            "date_upload_year": "year",
            "date_upload_month": "month",
            "date_upload_day": "day",
            "date_upload_hour": "hour",
            "date_upload_minute": "minute",
        }
    ),
    errors="coerce",  # Invalid dates become NaT
)
df["date_taken"] = pd.to_datetime(
    df[["date_taken_year", "date_taken_month", "date_taken_day", "date_taken_hour", "date_taken_minute"]].rename(
        columns={
            "date_taken_year": "year",
            "date_taken_month": "month",
            "date_taken_day": "day",
            "date_taken_hour": "hour",
            "date_taken_minute": "minute",
        }
    ),
    errors="coerce",  # Invalid dates become NaT
)

# Drop rows with NaT values
print(f"Rows removed: {df[df['date_upload'].isna() | df['date_taken'].isna()].shape[0]}")
df = df.dropna(subset=["date_upload", "date_taken"])
print(f"New dataframe length: {len(df)}\n")

# drop the now unnecessary columns
df.drop(
    columns=[
        "date_upload_year",
        "date_upload_month",
        "date_upload_day",
        "date_upload_hour",
        "date_upload_minute",
        "date_taken_year",
        "date_taken_month",
        "date_taken_day",
        "date_taken_hour",
        "date_taken_minute",
    ],
    inplace=True,
)
df.info()
print()
df.isna().sum()

Rows removed: 48
New dataframe length: 187544

<class 'pandas.core.frame.DataFrame'>
Index: 187544 entries, 0 to 420239
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           187544 non-null  int64
 1   user         187544 non-null  object
 2   lat          187544 non-null  float64
 3   long         187544 non-null  float64
 4   tags         140590 non-null  object
 5   title        170582 non-null  object
 6   date_upload  187544 non-null  datetime64[ns]
 7   date_taken   187544 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(2), int64(1), object(3)
memory usage: 12.9+ MB

id                 0
user               0
lat                0
long               0
tags           46954
title          16962
date_upload        0
date_taken         0
dtype: int64

In [8]:
# Check that date_taken is before date_upload
mask = df['date_taken'] <= df['date_upload']
df = df[mask]
print(f"Rows removed: {(~mask).sum()}")
print(f"New dataframe length: {len(df)}\n")

df.info()

Rows removed: 2335
New dataframe length: 185209

<class 'pandas.core.frame.DataFrame'>
Index: 185209 entries, 0 to 420239
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           185209 non-null  int64
 1   user         185209 non-null  object
 2   lat          185209 non-null  float64
 3   long         185209 non-null  float64
 4   tags         138805 non-null  object
 5   title        168309 non-null  object
 6   date_upload  185209 non-null  datetime64[ns]
 7   date_taken   185209 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(2), int64(1), object(3)
memory usage: 12.7+ MB

In [ ]:
# Sanity check for realistic dates
mask = (df['date_upload'].dt.year >= 2004) & (df['date_taken'].dt.year >= 1826)  # first photo ever taken in 1826, Flickr founded in 2004
df = df[mask]
print(f"Rows removed: {(~mask).sum()}")
print(f"New dataframe length: {len(df)}\n")

df.info()

Rows removed: 0
New dataframe length: 185209

<class 'pandas.core.frame.DataFrame'>
Index: 185209 entries, 0 to 420239
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           185209 non-null  int64
 1   user         185209 non-null  object
 2   lat          185209 non-null  float64
 3   long         185209 non-null  float64
 4   tags         138805 non-null  object
 5   title        168309 non-null  object
 6   date_upload  185209 non-null  datetime64[ns]
 7   date_taken   185209 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(2), int64(1), object(3)
memory usage: 12.7+ MB

In [10]:
# choose lat/long bounds for Lyon
mask = df["lat"].between(44.65, 45.9) & df["long"].between(4.70, 5.12)
df = df[mask]
print(f"Rows removed: {(~mask).sum()}")
print(f"New dataframe length: {len(df)}\n")

df.info()

Rows removed: 0
New dataframe length: 185209

<class 'pandas.core.frame.DataFrame'>
Index: 185209 entries, 0 to 420239
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           185209 non-null  int64
 1   user         185209 non-null  object
 2   lat          185209 non-null  float64
 3   long         185209 non-null  float64
 4   tags         138805 non-null  object
 5   title        168309 non-null  object
 6   date_upload  185209 non-null  datetime64[ns]
 7   date_taken   185209 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(2), int64(1), object(3)
memory usage: 12.7+ MB

In [11]:
df.to_csv("data/flickr_data_cleaned.csv", index=False, date_format='%Y-%m-%d %H:%M:%S')